test/fixtures/diagrams/core/advanced_parser_features.puml
@startuml
!include <C4/C4_Container>
    title Advanced Parser Feature Test Diagram

    Person_Ext(customer, "External Customer", "An external banking client.")
    System_Boundary(c1, "Internal Core") {
        SystemDb(coreDb, "Core DB", "Oracle", "Stores user profiles.")
        SystemQueue(notificationQueue, "Notification Queue", "RabbitMQ", "Stores notification events.")
        Container(apiGateway, "API Gateway", "Spring Cloud", "Routes API requests.")
        Container(authService, "Auth Service", "Go, OAuth2, JWT", "Handles user authorization, session validation, and \"single sign-on\" functionality.")
    }
    ContainerDb_Ext(partnerDb, "Partner Database", "PostgreSQL", "Stores partner transactional sync data.")

    BiRel(customer, apiGateway, "Interacts with", "HTTPS")
    Rel(apiGateway, authService, "Authenticates request using", "gRPC")
    Rel_Back(coreDb, apiGateway, "Pulls configurations", "JDBC")
    Rel_Down(apiGateway, notificationQueue, "Pushes event", "AMQP")
    Rel_Back(notificationQueue, partnerDb, "Feeds external sync", "JDBC/SSL")

@enduml
